tutorials/floatRigidBody/floatRigidBody_partioned_nOuter8/0.orig/beamone/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(5.32712804096e-19 -0.117558340443 3.46110276797e-14)
(5.6578542224e-19 -0.208473927197 6.13875416071e-14)
(1.92099830991e-19 -0.278675321298 8.2076228444e-14)
(-4.83334145298e-19 -0.332775104929 9.80361194761e-14)
(-1.31931515824e-18 -0.374361075006 1.10323380669e-13)
(-2.15632821715e-18 -0.406223179954 1.19757875635e-13)
(-2.83530325772e-18 -0.43053031274 1.26975345737e-13)
(-3.24825308101e-18 -0.448967990591 1.32468472715e-13)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-9.58813240147e-30 -2.54755396832e-30 5.68506931563e-31);
    }
    right
    {
        type            calculated;
        value           uniform (1.37429417481e-29 -6.74896658766e-30 -9.52712021578e-30);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
