tutorials/floatRigidBody/floatRigidBody_partioned_nOuter8/0.orig/beamone/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      Q;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(0.00631789044383 1.50052400687e-22 0.00346481931374)
(0.00631789044383 1.50052518695e-22 0.00349058668596)
(0.00631789044383 1.50052720373e-22 0.00351635405818)
(0.00631789044383 1.50053010126e-22 0.00354212143039)
(0.00631789044383 1.5005338953e-22 0.00356788880261)
(0.00631789044383 1.50053857763e-22 0.00359365617483)
(0.00631789044383 1.50054410734e-22 0.00361942354705)
(0.00631789044383 1.50055042516e-22 0.00364519091927)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-0.0063178904498 -1.90288852372e-12 -0.0034390519457);
    }
    right
    {
        type            calculated;
        value           uniform (0.00631789043801 -1.90288852342e-12 0.00446974682563);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
